# vstGetPickObject

## Description
```pascal
FUNCTION vstGetPickObject : HANDLE;
```

```python

def vs.vstGetPickObject():
    return HANDLE
```

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events